tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew 'git'
brew "carthage"
brew "cmake"
brew "cocoapods", link: false
brew "gcc"
brew "ghostscript"
brew "go"
brew "openssl"
brew "imagemagick", link: false
brew "imagemagick@6", link: true
brew "sqlite"
brew "jupyter"
brew "kompose"
brew "kubernetes-helm"
brew "libpq", link: true
brew "libxml2", link: true
brew "mongodb"
brew "mono"
brew "mysql"
brew "nginx"
brew "nmap"
brew "opencv"
brew "pkg-config"
brew "postgresql", link: false
brew "pyenv"
brew "rbenv"
brew "redis"
brew "tree"
brew "vim"
brew "yarn"
brew "heroku/brew/heroku"
cask "minikube"
cask "ngrok"
cask "skim"
cask "xquartz"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "slack"
cask "sourcetree"
