tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/theme"
brew 'git'
brew "cmake"
brew "cocoapods", link: false
brew "gcc"
brew "go"
brew "mono"
brew "nmap"
brew "pkg-config"
brew "pyenv"
brew "rbenv"
brew "tree"
brew "vim"
brew "yarn"
brew "heroku/brew/heroku"
cask "minikube"
cask "ngrok"
cask "skim"
cask "xquartz"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "slack"
cask "sourcetree"
cask "zsh"
