cask_args appdir: "/Applications"

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mongodb/brew"

brew "cmake"
brew "gcc"
brew "jq"
brew "tig"
brew "nmap"
brew "pkg-config"
brew "tree"
brew "vim"
brew "neovim"
brew "direnv"
brew "fzf"
brew "zsh"
brew "expect"
brew "ripgrep"
brew "pure"
brew "mysql"
brew "telnet"
brew "kubectx"
brew "kubectl"
brew "docker-compose"
brew "mongodb-community"
brew "java"
brew "graphviz"
brew "k9s"
brew "watch"
brew "ngrok"
brew "clang-format"
brew "trash-cli"
brew "nkf"

cask "ngrok"
cask "raycast"
cask "docker"
cask "google-chrome"
cask "slack"
cask "karabiner-elements"
cask "iterm2"
cask "visual-studio-code"
cask "insomnia"
cask "zoom"
cask "google-japanese-ime"
cask "google-cloud-sdk"
cask "miro"
cask "discord"
cask "itsycal"
cask "gyazo"
cask "bloomrpc"

mas "Yoink", id: 457622435
mas "LINE", id: 539883307

